SkydiverMCU/mcu-iap-demo/Cortex-M0/MM32F0270/USB_Virtual_COM/MM32F0270_VCOM_Bootloader/Device/MM32F0270/Include/reg_usb.h
////////////////////////////////////////////////////////////////////////////////
/// @file     reg_usb.h
/// @author   AE TEAM
/// @brief    THIS FILE CONTAINS ALL THE FUNCTIONS PROTOTYPES FOR THE SERIES OF
///           MM32 FIRMWARE LIBRARY.
////////////////////////////////////////////////////////////////////////////////
/// @attention
///
/// THE EXISTING FIRMWARE IS ONLY FOR REFERENCE, WHICH IS DESIGNED TO PROVIDE
/// CUSTOMERS WITH CODING INFORMATION ABOUT THEIR PRODUCTS SO THEY CAN SAVE
/// TIME. THEREFORE, MINDMOTION SHALL NOT BE LIABLE FOR ANY DIRECT, INDIRECT OR
/// CONSEQUENTIAL DAMAGES ABOUT ANY CLAIMS ARISING OUT OF THE CONTENT OF SUCH
/// HARDWARE AND/OR THE USE OF THE CODING INFORMATION CONTAINED HEREIN IN
/// CONNECTION WITH PRODUCTS MADE BY CUSTOMERS.
///
/// <H2><CENTER>&COPY; COPYRIGHT MINDMOTION </CENTER></H2>
////////////////////////////////////////////////////////////////////////////////

// Define to prevent recursive inclusion

#ifndef __REG_USB_H
#define __REG_USB_H

// Files includes

#include <stdint.h>
#include <stdbool.h>
#include "types.h"


#if defined ( __CC_ARM )
#pragma anon_unions
#endif


////////////////////////////////////////////////////////////////////////////////
/// @brief USB Base Address Definition
////////////////////////////////////////////////////////////////////////////////
#define USB_BASE                        (APB1PERIPH_BASE + 0x5C00)              ///< Base Address: 0x40005C00


////////////////////////////////////////////////////////////////////////////////
/// @brief USB Register Structure Definition
////////////////////////////////////////////////////////////////////////////////
typedef struct 
{
    __IO uint32_t TOP;                                                               ///< Top Register                                   offset: 0x00
    __IO uint32_t INT_STATE;                                                         ///< Interrupt State Register                       offset: 0x04
    __IO uint32_t EP_INT_STATE;                                                      ///< Endpoint Interrupt State Register              offset: 0x08
    __IO uint32_t EP0_INT_STATE;                                                     ///< EP0 Interrupt State Register                   offset: 0x0C
    __IO uint32_t INT_EN;                                                            ///< Interrupt Enable Register                      offset: 0x10
    __IO uint32_t EP_INT_EN;                                                         ///< Endpoint Interrupt Enable Register             offset: 0x14
    __IO uint32_t EP0_INT_EN;                                                        ///< EP0 Interrupt Enable Register                  offset: 0x18

    __IO uint32_t RESERVED0;                                                         ///< Reserved                                       offset: 0x1C

    __IO uint32_t EPx_INT_STATE[4];                                                  ///< EP1 2 3 4 Interrupt State Register                   offset: 0x20

    __IO uint32_t RESERVED1[4];                                                      ///< Reserved                                       offset: 0x30

    __IO uint32_t EPx_INT_EN[4];                                                     ///< EP1 2 3 4 Interrupt Enable Register                  offset: 0x40

    __IO uint32_t RESERVED5[4];                                                      ///< Reserved                                       offset: 0x50

    __IO uint32_t ADDR;                                                              ///< USB Address Register                           offset: 0x60
    __IO uint32_t EP_EN;                                                             ///< Endpoint Enable Register                       offset: 0x64
    __IO uint32_t EP_DMA_DIR;                                                        ///< Endpoint DMA direction Register                offset: 0x68
    __IO uint32_t EP_TYPE;                                                           ///< Endpoint type Register                         offset: 0x6C
    __IO uint32_t EP_INDEX1_2;                                                       ///< Endpoint index Register                        offset: 0x70
    __IO uint32_t EP_INDEX3_4;                                                       ///< Endpoint index Register                        offset: 0x74

    __IO uint32_t TOG_CTRL1_4;                                                       ///< Toggle Control Register                        offset: 0x78

    __IO uint32_t TOG_STAT1_4;                                                       ///< Toggle status Register                         offset: 0x7C

    __IO uint32_t SETUPx[8];                                                         ///< SETUP Packet Byte 0 Register                   offset: 0x80
    __IO uint32_t PACKET_SIZEL;                                                      ///< Packet SIZE Register                           offset: 0xA0
    __IO uint32_t PACKET_SIZEH;                                                      ///< Packet SIZE Register                           offset: 0xA4

    __IO uint32_t RESERVED14[22];                                                    ///< Reserved                                       offset: 0xA8

    __IO uint32_t EPx_AVAIL[5];                                                      ///< EP0 1 2 3 4 Available Data Register                    offset: 0x100

    __IO uint32_t RESERVED36[3];                                                    ///< Reserved                                       offset: 0x114
    __IO uint32_t DMA_ADDR0;                                                        ///< USB endpoint 2 DMA address 0 register          offset: 0x120
    __IO uint32_t DMA_ADDR1;                                                        ///< USB endpoint 2 DMA address 1 register          offset: 0x124
    __IO uint32_t DMA_ADDR2;                                                        ///< USB endpoint 2 DMA address 2 register          offset: 0x128
    __IO uint32_t DMA_ADDR3;                                                        ///< USB endpoint 2 DMA address 3 register          offset: 0x12C
    __IO uint32_t DMA_NUML;                                                         ///< DMA data  Register                            offset: 0x130
    __IO uint32_t DMA_NUMH;                                                         ///< DMA data  Register                            offset: 0x134
    
