SkydiverMCU/mcu-iap-demo/Cortex-M0/MM32F0270/USB_Virtual_COM/MM32F0270_VCOM_Bootloader/Device/MM32F0270/Include/reg_usb.h
////////////////////////////////////////////////////////////////////////////////
/// @brief USB_POWER Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define USB_POWER_SUSPEN_Pos            (0)
#define USB_POWER_SUSPEN                (0x01U << USB_POWER_SUSPEN_Pos)         ///< BUS suspend enable bit
#define USB_POWER_SUSP_Pos              (1)
#define USB_POWER_SUSP                  (0x01U << USB_POWER_SUSP_Pos)           ///< suspend status
#define USB_POWER_WKUP_Pos              (3)
#define USB_POWER_WKUP                  (0x01U << USB_POWER_WKUP_Pos)           ///< Enable controller wake up from suspend state
////////////////////////////////////////////////////////////////////////////////
/// @brief USB_AHB_DMA Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define USB_AHB_DMA_CH0_BS_Pos          (0)
#define USB_AHB_DMA_CH0_BS              (0x03U << USB_AHB_DMA_CH0_BS_Pos)        ///< Channel 0 transmits 2 bytes at a time
#define USB_AHB_DMA_CH1_BS_Pos          (2)
#define USB_AHB_DMA_CH1_BS              (0x03U << USB_AHB_DMA_CH1_BS_Pos)        ///< Channel 1 transmits 2 bytes at a time
#define USB_AHB_DMA_CH2_BS_Pos          (4)
#define USB_AHB_DMA_CH2_BS              (0x03U << USB_AHB_DMA_CH2_BS_Pos)        ///< Channel 2 transmits 2 bytes at a time
#define USB_AHB_DMA_CH3_BS_Pos          (6)
#define USB_AHB_DMA_CH3_BS              (0x03U << USB_AHB_DMA_CH3_BS_Pos)        ///< Channel 3 transmits 2 bytes at a time
////////////////////////////////////////////////////////////////////////////////
/// @brief USB_AHB_RST Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define USB_AHB_RST_EP0_Pos             (0)
#define USB_AHB_RST_EP0                 (0x01U << USB_AHB_RST_EP0_Pos)        ///< point 0 rest
#define USB_AHB_RST_EP1_Pos             (1)
#define USB_AHB_RST_EP1                 (0x01U << USB_AHB_RST_EP1_Pos)        ///< point 1 rest
#define USB_AHB_RST_EP2_Pos             (2)
#define USB_AHB_RST_EP2                 (0x01U << USB_AHB_RST_EP2_Pos)        ///< point 2 rest
#define USB_AHB_RST_EP3_Pos             (3)
#define USB_AHB_RST_EP3                 (0x01U << USB_AHB_RST_EP3_Pos)        ///< point 3 rest
#define USB_AHB_RST_EP4_Pos             (4)
#define USB_AHB_RST_EP4                 (0x01U << USB_AHB_RST_EP4_Pos)        ///< point 4 rest



/// @}

/// @}

/// @}

////////////////////////////////////////////////////////////////////////////////
#endif
////////////////////////////////////////////////////////////////////////////////
